Revit 2027 API
RebarCrankOverridableParameters.GetCrankStartStraightLengthFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankStartStraightLengthFormulaParams()
Public Function GetCrankStartStraightLengthFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankStartStraightLengthFormulaParams()
member GetCrankStartStraightLengthFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace